nxp-mcuxpresso/mcux-sdk/devices/MCXW716A/MCXW716A.h
#define XCVR_TSM_CTRL_TSM_SOFT_RESET_MASK        (0x2U)
#define XCVR_TSM_CTRL_TSM_SOFT_RESET_SHIFT       (1U)
/*! TSM_SOFT_RESET - TSM Soft Reset
 *  0b0..TSM Soft Reset removed. Normal operation.
 *  0b1..TSM Soft Reset engaged. TSM forced to IDLE, and holds there until the bit is cleared.
 */
#define XCVR_TSM_CTRL_TSM_SOFT_RESET(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_TSM_SOFT_RESET_SHIFT)) & XCVR_TSM_CTRL_TSM_SOFT_RESET_MASK)

#define XCVR_TSM_CTRL_FORCE_TX_EN_MASK           (0x4U)
#define XCVR_TSM_CTRL_FORCE_TX_EN_SHIFT          (2U)
/*! FORCE_TX_EN - Force Transmit Enable
 *  0b0..TSM Idle
 *  0b1..TSM executes a TX sequence
 */
#define XCVR_TSM_CTRL_FORCE_TX_EN(x)             (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_FORCE_TX_EN_SHIFT)) & XCVR_TSM_CTRL_FORCE_TX_EN_MASK)

#define XCVR_TSM_CTRL_FORCE_RX_EN_MASK           (0x8U)
#define XCVR_TSM_CTRL_FORCE_RX_EN_SHIFT          (3U)
/*! FORCE_RX_EN - Force Receive Enable
 *  0b0..TSM Idle
 *  0b1..TSM executes a RX sequence
 */
#define XCVR_TSM_CTRL_FORCE_RX_EN(x)             (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_FORCE_RX_EN_SHIFT)) & XCVR_TSM_CTRL_FORCE_RX_EN_MASK)

#define XCVR_TSM_CTRL_TX_ABORT_DIS_MASK          (0x10U)
#define XCVR_TSM_CTRL_TX_ABORT_DIS_SHIFT         (4U)
/*! TX_ABORT_DIS - Transmit Abort Disable */
#define XCVR_TSM_CTRL_TX_ABORT_DIS(x)            (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_TX_ABORT_DIS_SHIFT)) & XCVR_TSM_CTRL_TX_ABORT_DIS_MASK)

#define XCVR_TSM_CTRL_RX_ABORT_DIS_MASK          (0x20U)
#define XCVR_TSM_CTRL_RX_ABORT_DIS_SHIFT         (5U)
/*! RX_ABORT_DIS - Receive Abort Disable */
#define XCVR_TSM_CTRL_RX_ABORT_DIS(x)            (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_RX_ABORT_DIS_SHIFT)) & XCVR_TSM_CTRL_RX_ABORT_DIS_MASK)

#define XCVR_TSM_CTRL_ABORT_ON_CTUNE_MASK        (0x40U)
#define XCVR_TSM_CTRL_ABORT_ON_CTUNE_SHIFT       (6U)
/*! ABORT_ON_CTUNE - Abort On Coarse Tune Lock Detect Failure
 *  0b0..don't allow TSM abort on Coarse Tune Unlock Detect
 *  0b1..allow TSM abort on Coarse Tune Unlock Detect
 */
#define XCVR_TSM_CTRL_ABORT_ON_CTUNE(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_ABORT_ON_CTUNE_SHIFT)) & XCVR_TSM_CTRL_ABORT_ON_CTUNE_MASK)

#define XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG_MASK    (0x80U)
#define XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG_SHIFT   (7U)
/*! ABORT_ON_FREQ_TARG - Abort On Frequency Target Lock Detect Failure
 *  0b0..don't allow TSM abort on Frequency Target Unlock Detect
 *  0b1..allow TSM abort on Frequency Target Unlock Detect
 */
#define XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG_SHIFT)) & XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG_MASK)

#define XCVR_TSM_CTRL_TSM_IRQ0_EN_MASK           (0x100U)
#define XCVR_TSM_CTRL_TSM_IRQ0_EN_SHIFT          (8U)
/*! TSM_IRQ0_EN - TSM_IRQ0 Enable/Disable bit
 *  0b0..TSM_IRQ0 is disabled
 *  0b1..TSM_IRQ0 is enabled
 */
#define XCVR_TSM_CTRL_TSM_IRQ0_EN(x)             (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_TSM_IRQ0_EN_SHIFT)) & XCVR_TSM_CTRL_TSM_IRQ0_EN_MASK)

#define XCVR_TSM_CTRL_TSM_IRQ1_EN_MASK           (0x200U)
#define XCVR_TSM_CTRL_TSM_IRQ1_EN_SHIFT          (9U)
/*! TSM_IRQ1_EN - TSM_IRQ1 Enable/Disable bit
 *  0b0..TSM_IRQ1 is disabled
 *  0b1..TSM_IRQ1 is enabled
 */
#define XCVR_TSM_CTRL_TSM_IRQ1_EN(x)             (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_TSM_IRQ1_EN_SHIFT)) & XCVR_TSM_CTRL_TSM_IRQ1_EN_MASK)

#define XCVR_TSM_CTRL_PLL_UNLOCK_IRQ_EN_MASK     (0x400U)
#define XCVR_TSM_CTRL_PLL_UNLOCK_IRQ_EN_SHIFT    (10U)
/*! PLL_UNLOCK_IRQ_EN - PLL Unlock Interrupt Enable
 *  0b0..allows PLL unlock event to generate an interrupt
 *  0b1..A PLL unlock event will set the PLL_UNLOCK_IRQ status bit, but an interrupt is not generated
 */
#define XCVR_TSM_CTRL_PLL_UNLOCK_IRQ_EN(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_PLL_UNLOCK_IRQ_EN_SHIFT)) & XCVR_TSM_CTRL_PLL_UNLOCK_IRQ_EN_MASK)

#define XCVR_TSM_CTRL_PLL_UNLOCK_IRQ_MASK        (0x800U)
#define XCVR_TSM_CTRL_PLL_UNLOCK_IRQ_SHIFT       (11U)
/*! PLL_UNLOCK_IRQ - PLL Unlock IRQ
 *  0b0..A PLL Unlock Interrupt has not occurred
 *  0b1..A PLL Unlock Interrupt has occurred
 */
#define XCVR_TSM_CTRL_PLL_UNLOCK_IRQ(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_PLL_UNLOCK_IRQ_SHIFT)) & XCVR_TSM_CTRL_PLL_UNLOCK_IRQ_MASK)

#define XCVR_TSM_CTRL_TSM_LL_INHIBIT_MASK        (0xF000U)
#define XCVR_TSM_CTRL_TSM_LL_INHIBIT_SHIFT       (12U)
/*! TSM_LL_INHIBIT - TSM Per-Link-Layer Inhibit */
#define XCVR_TSM_CTRL_TSM_LL_INHIBIT(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_TSM_LL_INHIBIT_SHIFT)) & XCVR_TSM_CTRL_TSM_LL_INHIBIT_MASK)

#define XCVR_TSM_CTRL_TSM_SPARE1_EXTEND_MASK     (0xFF0000U)
#define XCVR_TSM_CTRL_TSM_SPARE1_EXTEND_SHIFT    (16U)
/*! TSM_SPARE1_EXTEND - TSM RF_ACTIVE Extension Duration */
#define XCVR_TSM_CTRL_TSM_SPARE1_EXTEND(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_TSM_SPARE1_EXTEND_SHIFT)) & XCVR_TSM_CTRL_TSM_SPARE1_EXTEND_MASK)

#define XCVR_TSM_CTRL_BKPT_MASK                  (0xFF000000U)
#define XCVR_TSM_CTRL_BKPT_SHIFT                 (24U)
/*! BKPT - TSM Breakpoint */
#define XCVR_TSM_CTRL_BKPT(x)                    (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL_BKPT_SHIFT)) & XCVR_TSM_CTRL_BKPT_MASK)
/*! @} */

/*! @name LPPS_CTRL - TSM CONTROL */
/*! @{ */

#define XCVR_TSM_LPPS_CTRL_LPPS_LNA_MIX_ALLOW_MASK (0x2U)
#define XCVR_TSM_LPPS_CTRL_LPPS_LNA_MIX_ALLOW_SHIFT (1U)
/*! LPPS_LNA_MIX_ALLOW - LPPS_LNA_MIX_ALLOW */
#define XCVR_TSM_LPPS_CTRL_LPPS_LNA_MIX_ALLOW(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_LPPS_CTRL_LPPS_LNA_MIX_ALLOW_SHIFT)) & XCVR_TSM_LPPS_CTRL_LPPS_LNA_MIX_ALLOW_MASK)

#define XCVR_TSM_LPPS_CTRL_LPPS_CBPF_ALLOW_MASK  (0x4U)
#define XCVR_TSM_LPPS_CTRL_LPPS_CBPF_ALLOW_SHIFT (2U)
/*! LPPS_CBPF_ALLOW - LPPS_CBPF_ALLOW */
#define XCVR_TSM_LPPS_CTRL_LPPS_CBPF_ALLOW(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_LPPS_CTRL_LPPS_CBPF_ALLOW_SHIFT)) & XCVR_TSM_LPPS_CTRL_LPPS_CBPF_ALLOW_MASK)

#define XCVR_TSM_LPPS_CTRL_LPPS_ADC_ALLOW_MASK   (0x8U)
#define XCVR_TSM_LPPS_CTRL_LPPS_ADC_ALLOW_SHIFT  (3U)
/*! LPPS_ADC_ALLOW - LPPS_ADC_ALLOW */
#define XCVR_TSM_LPPS_CTRL_LPPS_ADC_ALLOW(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_LPPS_CTRL_LPPS_ADC_ALLOW_SHIFT)) & XCVR_TSM_LPPS_CTRL_LPPS_ADC_ALLOW_MASK)

#define XCVR_TSM_LPPS_CTRL_LPPS_LO_RX_ALLOW_MASK (0x10U)
#define XCVR_TSM_LPPS_CTRL_LPPS_LO_RX_ALLOW_SHIFT (4U)
/*! LPPS_LO_RX_ALLOW - LPPS_LO_RX_ALLOW */
#define XCVR_TSM_LPPS_CTRL_LPPS_LO_RX_ALLOW(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_LPPS_CTRL_LPPS_LO_RX_ALLOW_SHIFT)) & XCVR_TSM_LPPS_CTRL_LPPS_LO_RX_ALLOW_MASK)

#define XCVR_TSM_LPPS_CTRL_LPPS_LO_RXDRV_ALLOW_MASK (0x20U)
#define XCVR_TSM_LPPS_CTRL_LPPS_LO_RXDRV_ALLOW_SHIFT (5U)
/*! LPPS_LO_RXDRV_ALLOW - LPPS_LO_RXDRV_ALLOW */
#define XCVR_TSM_LPPS_CTRL_LPPS_LO_RXDRV_ALLOW(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_LPPS_CTRL_LPPS_LO_RXDRV_ALLOW_SHIFT)) & XCVR_TSM_LPPS_CTRL_LPPS_LO_RXDRV_ALLOW_MASK)

#define XCVR_TSM_LPPS_CTRL_LPPS_RX_DIG_ALLOW_MASK (0x40U)
#define XCVR_TSM_LPPS_CTRL_LPPS_RX_DIG_ALLOW_SHIFT (6U)
/*! LPPS_RX_DIG_ALLOW - LPPS_RX_DIG_ALLOW */
#define XCVR_TSM_LPPS_CTRL_LPPS_RX_DIG_ALLOW(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_LPPS_CTRL_LPPS_RX_DIG_ALLOW_SHIFT)) & XCVR_TSM_LPPS_CTRL_LPPS_RX_DIG_ALLOW_MASK)

#define XCVR_TSM_LPPS_CTRL_LPPS_RX_PHY_ALLOW_MASK (0x80U)
#define XCVR_TSM_LPPS_CTRL_LPPS_RX_PHY_ALLOW_SHIFT (7U)
/*! LPPS_RX_PHY_ALLOW - LPPS_RX_PHY_ALLOW */
#define XCVR_TSM_LPPS_CTRL_LPPS_RX_PHY_ALLOW(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_LPPS_CTRL_LPPS_RX_PHY_ALLOW_SHIFT)) & XCVR_TSM_LPPS_CTRL_LPPS_RX_PHY_ALLOW_MASK)

#define XCVR_TSM_LPPS_CTRL_LPPS_START_RX_MASK    (0xFF0000U)
#define XCVR_TSM_LPPS_CTRL_LPPS_START_RX_SHIFT   (16U)
/*! LPPS_START_RX - LPPS Fast TSM RX Warmup "Jump-from" Point */
#define XCVR_TSM_LPPS_CTRL_LPPS_START_RX(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_LPPS_CTRL_LPPS_START_RX_SHIFT)) & XCVR_TSM_LPPS_CTRL_LPPS_START_RX_MASK)

#define XCVR_TSM_LPPS_CTRL_LPPS_DEST_RX_MASK     (0xFF000000U)
#define XCVR_TSM_LPPS_CTRL_LPPS_DEST_RX_SHIFT    (24U)
/*! LPPS_DEST_RX - LPPS Fast TSM RX Warmup "Jump-to" Point */
#define XCVR_TSM_LPPS_CTRL_LPPS_DEST_RX(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_LPPS_CTRL_LPPS_DEST_RX_SHIFT)) & XCVR_TSM_LPPS_CTRL_LPPS_DEST_RX_MASK)
/*! @} */

